Revit 2024 API
FabricationConfiguration.GetFabricationConnectorName Method
 Gets the fabrication connector name from its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public string GetFabricationConnectorName(
	int fabricationConnectorId
)
Visual Basic
Public Function GetFabricationConnectorName ( _
	fabricationConnectorId As Integer _
) As String
Visual C++
public:
String^ GetFabricationConnectorName(
	int fabricationConnectorId
)
Parameters
fabricationConnectorId
Type: System.Int32
 The fabrication connector identifier.
Return Value
 The fabrication connector's name.
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace